savepoint/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |
      |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312
      |
|   \\  /    A nd           | Website:  www.openfoam.com
      |
|    \\/     M anipulation  |
      |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.1;

vertices
(
    // Back
    (0 0 0)    // vertex 0
    (1 0 0)    // vertex 1
    (1 -0.2  0)  // vertex 2
    (1.1 -0.2 0) // vertex 3
    (1.1 0 0)  // vertex 4
    (12 0 0)   // vertex 5
    (12 2 0)   // vertex 6
    (1.1 2 0)  // vertex 7
    (1 2 0)    // vertex 8
    (0 2 0)    // vertex 9
    // Front
    (0 0 1)    // vertex 10
    (1 0 1)    // vertex 11
    (1 -0.2 1)   // vertex 12
    (1.1 -0.2 1) // vertex 13
    (1.1 0 1)  // vertex 14
    (12 0 1)   // vertex 15
    (12 2 1)   // vertex 16
    (1.1 2 1)  // vertex 17
    (1 2 1)    // vertex 18
    (0 2 1)    // vertex 19
);

blocks
(
    // Block 0
    hex (0 1 8 9 10 11 18 19) (20 20 1) simpleGrading (1 1 1)
    // Block 1
    hex (1 4 7 8 11 14 17 18) (10 20 1) simpleGrading (1 1 1)
    // Block 2
    hex (4 5 6 7 14 15 16 17) (30 20 1) simpleGrading (1 1 1)
    // Block 3 Fuel
    hex (2 3 4 1 12 13 14 11) (10 20 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 10 19 9)
        );
    }

    fuel
    {
        type patch;
        faces
        (
            (2 3 13 12)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (5 6 16 15)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (0 1 11 10)
            (11 1 2 12)
            (4 14 13 3)
            (4 5 15 14)
            (17 16 6 7)
            (18 17 7 8)
            (19 18 8 9)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (10 11 18 19)
            (11 12 13 14)
            (11 14 17 18)
            (14 15 16 17)
            (9 8 1 0)
            (8 7 4 1)
            (7 6 5 4)
            (1 4 3 2)
        );
    }

);

// ************************************************************************* //
